# 01, Analysis Seoul CCTV

In [1]:
### 데이터 분석을 위한 패키지 : Pandas 
import pandas as pd

### 미설치 시 설치 방법 
 !conda install -y pandas

In [2]:
### CSV 파일 읽기
CCTV_Seoul = pd.read_csv("../../data/01.Seoul_CCTV/01. Seoul_CCTV.csv", encoding="UTF-8")

In [3]:
CCTV_Seoul.head()
### 2행 만 읽기 CCTV_Seoul.head(2)

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [4]:
### 끝에 줄만 읽기
CCTV_Seoul.tail()

    기관명    소계  2013년도 이전  2014년  2015년  2016년
20  용산구  2096       1368    218    112    398
21  은평구  2108       1138    224    278    468
22  종로구  1619        464    314    211    630
23   중구  1023        413    190     72    348
24  중랑구   916        509    121    177    109

In [5]:
### 컬럼 명의 변경 
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [6]:
### 특정 컬럼 출력 
CCTV_Seoul.columns[0]

'기관명'

In [7]:
### 컬럼명 변경하기 
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : "구별"},inplace=True)

In [8]:
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [9]:
### 엑셀 파일 읽기
pop_Seoul = pd.read_excel("../../data/01.Seoul_CCTV/01. Seoul_Population.xls",header=2,usecols="B,D,G,J,N")
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [10]:
pop_Seoul.rename({pop_Seoul.columns[0]:"구별"},inplace=True)

In [11]:
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

# Pandas의 기초
- 파이썬에서 R만큼의 강력한 데이터 핸들링을제공하는 모듈
- 단일 프로세스에서는 최대 효율
- 코딩이 가능한 엑셀

In [12]:
import pandas as pd
import numpy as np

- pandas는 통상적으로 pd 
- numpy는 통상적으로 np

# Series
- index 와 Value 로 이뤄짐
- 한 가지 데이터 형만 가질 수 있음

In [2]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
pd.Series([1,2,3,4] , dtype=np.float64)

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

In [10]:
### object : String과 같음
pd.Series([1,2,3,4] , dtype=str)

0    1
1    2
2    3
3    4
dtype: object

In [12]:
### numpy로 선언
pd.Series(np.array([1,2,3,4]))

0    1
1    2
2    3
3    4
dtype: int32

In [14]:
### 딕셔너리 선언 
pd.Series({"Key":"Value"})

Key    Value
dtype: object

In [18]:
### 숫자와 문자열을 동시에 선언가능 - 결과값 : object 
data=pd.Series([1,2,3,4,"5"])
data

0    1
1    2
2    3
3    4
4    5
dtype: object

In [20]:
### 짝수만 찾기 
data=pd.Series([1,2,3,4])
data%2

0    1
1    0
2    1
3    0
dtype: int64

### 날짜데이터 
- 날짜 : 문자열로 선언
- periods : 언제까지 할건지

In [22]:
pd.date_range("20250524",periods=6)

DatetimeIndex(['2025-05-24', '2025-05-25', '2025-05-26', '2025-05-27',
               '2025-05-28', '2025-05-29'],
              dtype='datetime64[ns]', freq='D')

# DataFrame
- pd.DataFrame()
- index, value, column으로 이뤄짐

In [14]:
### 표준 정규분포에서 샘플링한 난수 생성 
data=np.random.randn(6,4)
dates=pd.date_range("20250524",periods=6)

df=pd.DataFrame(data,index=dates,columns=["A","B","C","D"])

### 데이터 프레임 정보 탐색

#### df.head()
-  위쪽 데이터 출력

In [ ]:
df.head()

                   A         B         C         D
2025-05-24  1.867515 -2.775664 -1.864494  1.907741
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-28  1.053450  1.801555  0.312656  0.045946

#### df.tail()
-  아래쪽 데이터 출력

In [ ]:
df.tail()

                   A         B         C         D
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451

### df.index
- 인덱스 출력

In [17]:
df.index

DatetimeIndex(['2025-05-24', '2025-05-25', '2025-05-26', '2025-05-27',
               '2025-05-28', '2025-05-29'],
              dtype='datetime64[ns]', freq='D')

### df.columns
- 컬럼 출력

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### df.values
- 값들 출력

In [19]:
df.values

array([[ 1.86751471, -2.77566381, -1.86449444,  1.90774119],
       [-0.27555467,  1.01621047, -0.97158812,  0.91400013],
       [-0.93792124,  0.82090269,  0.19925995, -1.61611487],
       [ 1.13053067, -0.05145772,  1.46486268, -0.58595068],
       [ 1.05344951,  1.8015548 ,  0.31265574,  0.04594614],
       [-1.76402585, -1.4874145 , -0.73655225,  1.00245119]])

### df.info()
- 데이터 프레임의 기본 정보 확인

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2025-05-24 to 2025-05-29
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

### df.describe()
- 데이터 프레임의 기술 통계 정보를 확인 가능

In [21]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.178999 -0.112645 -0.265976  0.278012
std    1.396470  1.720197  1.168046  1.262800
min   -1.764026 -2.775664 -1.864494 -1.616115
25%   -0.772330 -1.128425 -0.912829 -0.427976
50%    0.388947  0.384722 -0.268646  0.479973
75%    1.111260  0.967384  0.284307  0.980338
max    1.867515  1.801555  1.464863  1.907741

### df.sort_values()
- 데이터 정렬
- 특정 컬럼을 기준으로 데이터를 정렬함

In [23]:
df

                   A         B         C         D
2025-05-24  1.867515 -2.775664 -1.864494  1.907741
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451

In [22]:
df.sort_values(by="B")

                   A         B         C         D
2025-05-24  1.867515 -2.775664 -1.864494  1.907741
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-28  1.053450  1.801555  0.312656  0.045946

##### ascending=False
- 내림차순  하는 옵션

In [24]:
df.sort_values(by="B",ascending=False)

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451
2025-05-24  1.867515 -2.775664 -1.864494  1.907741

##### inplace=True
  정렬 저장하기

In [25]:
df.sort_values(by="B",ascending=False,inplace=True)

### 데이터 선택

#### df[<컬럼명>]
- 특정 컬럼 선택
- 시리즈 타입을 리턴함

In [27]:
df["A"]

2025-05-28    1.053450
2025-05-25   -0.275555
2025-05-26   -0.937921
2025-05-27    1.130531
2025-05-29   -1.764026
2025-05-24    1.867515
Name: A, dtype: float64

- 컬럼명이 알파벳인 경우 대괄화 없이 가능

In [28]:
df.A

2025-05-28    1.053450
2025-05-25   -0.275555
2025-05-26   -0.937921
2025-05-27    1.130531
2025-05-29   -1.764026
2025-05-24    1.867515
Name: A, dtype: float64

#### df[<컬럼1>,<컬럼2>]
  - 복수의 컬럼 선택

In [29]:
df[["A","B"]]

                   A         B
2025-05-28  1.053450  1.801555
2025-05-25 -0.275555  1.016210
2025-05-26 -0.937921  0.820903
2025-05-27  1.130531 -0.051458
2025-05-29 -1.764026 -1.487415
2025-05-24  1.867515 -2.775664

#### df[n:m] 
- n부터 m-1까지 슬라이싱

In [30]:
df[0:3]

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115

#### df[<컬럼명1>:<컬럼명2>]
- 컬럼명 1 부터 컬럼명 2까지 (포함)

In [34]:
df["2025-05-25":"2025-05-28"]

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951

#### loc
- 인덱스 이름으로 특정 행과 열을 선택

In [35]:
df.loc[:,["A","B"]]

                   A         B
2025-05-28  1.053450  1.801555
2025-05-25 -0.275555  1.016210
2025-05-26 -0.937921  0.820903
2025-05-27  1.130531 -0.051458
2025-05-29 -1.764026 -1.487415
2025-05-24  1.867515 -2.775664

In [36]:
df.loc["2025-05-25":"2025-05-28",["A","B"]]

                   A         B
2025-05-28  1.053450  1.801555
2025-05-25 -0.275555  1.016210
2025-05-26 -0.937921  0.820903
2025-05-27  1.130531 -0.051458

In [39]:
df.loc["2025-05-25":"2025-05-28","A":"D"]

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951

### iloc
- 컴퓨터가 인식하는 인덱스 값으로 선택 
- 0,1,2,3,4 등으로  선택함

In [40]:
df.iloc[3]

A    1.130531
B   -0.051458
C    1.464863
D   -0.585951
Name: 2025-05-27 00:00:00, dtype: float64

In [41]:
df.iloc[3,2]

1.4648626792222865

In [42]:
df.iloc[3:5,0:2]

                   A         B
2025-05-27  1.130531 -0.051458
2025-05-29 -1.764026 -1.487415

##### 특정 컬럼만 선택하기

In [43]:
df.iloc[[1,2,4],[0.,2]]

                   A         C
2025-05-25 -0.275555 -0.971588
2025-05-26 -0.937921  0.199260
2025-05-29 -1.764026 -0.736552

In [44]:
df.iloc[:,1:3]

                   B         C
2025-05-28  1.801555  0.312656
2025-05-25  1.016210 -0.971588
2025-05-26  0.820903  0.199260
2025-05-27 -0.051458  1.464863
2025-05-29 -1.487415 -0.736552
2025-05-24 -2.775664 -1.864494

#### 조건 부여 (Condition)

-  0보다 큰 숫자만 선택 
-  NaN : Not a Number : 숫자가 없음

In [48]:
df["A"]>0

2025-05-28     True
2025-05-25    False
2025-05-26    False
2025-05-27     True
2025-05-29    False
2025-05-24     True
Name: A, dtype: bool

In [47]:
df[df["A"]>0]

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-24  1.867515 -2.775664 -1.864494  1.907741

In [49]:
df[df>0]

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-25       NaN  1.016210       NaN  0.914000
2025-05-26       NaN  0.820903  0.199260       NaN
2025-05-27  1.130531       NaN  1.464863       NaN
2025-05-29       NaN       NaN       NaN  1.002451
2025-05-24  1.867515       NaN       NaN  1.907741

### 컬럼 추가
#### df["컬럼명"]=[<컬럼내용>]
- 기존 컬럼이 없을 시 추가 
- 기존 컬럼이 있을 시 업데이트

In [51]:
df["E"]=["1","2","3","4","4","5"]
df

                   A         B         C         D  E
2025-05-28  1.053450  1.801555  0.312656  0.045946  1
2025-05-25 -0.275555  1.016210 -0.971588  0.914000  2
2025-05-26 -0.937921  0.820903  0.199260 -1.616115  3
2025-05-27  1.130531 -0.051458  1.464863 -0.585951  4
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451  4
2025-05-24  1.867515 -2.775664 -1.864494  1.907741  5

#### isin()
- 특정 요소가 있는지 확인 
- bool로 리턴함

In [54]:
df["E"].isin(["1","4"])

2025-05-28     True
2025-05-25    False
2025-05-26    False
2025-05-27     True
2025-05-29     True
2025-05-24    False
Name: E, dtype: bool

- 실제로 존재하는 값만 출력하기

In [55]:
df[df["E"].isin(["1","4"])]

                   A         B         C         D  E
2025-05-28  1.053450  1.801555  0.312656  0.045946  1
2025-05-27  1.130531 -0.051458  1.464863 -0.585951  4
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451  4

### 특정 컬럼 제거 
- del
- drop

In [58]:
del df["E"]
df

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451
2025-05-24  1.867515 -2.775664 -1.864494  1.907741

#### drop 
- axis 옵션을 통해서 어떤걸 삭제 할지 바꿈
- axis = 0 : 가로 
- axis = 1 : 세로

In [61]:
df.drop(["D"] , axis=1)

                   A         B         C
2025-05-28  1.053450  1.801555  0.312656
2025-05-25 -0.275555  1.016210 -0.971588
2025-05-26 -0.937921  0.820903  0.199260
2025-05-27  1.130531 -0.051458  1.464863
2025-05-29 -1.764026 -1.487415 -0.736552
2025-05-24  1.867515 -2.775664 -1.864494

In [62]:
df.drop(["2025-05-24"] , axis=0)

                   A         B         C         D
2025-05-28  1.053450  1.801555  0.312656  0.045946
2025-05-25 -0.275555  1.016210 -0.971588  0.914000
2025-05-26 -0.937921  0.820903  0.199260 -1.616115
2025-05-27  1.130531 -0.051458  1.464863 -0.585951
2025-05-29 -1.764026 -1.487415 -0.736552  1.002451

a

In [63]:
df["A"].apply("sum")

1.073993127347401

In [66]:
df[["A","D"]].apply("sum")

A    1.073993
D    1.668073
dtype: float64

In [67]:
df["A"].apply(np.cumsum)

2025-05-28      [1.0534495141271714]
2025-05-25    [-0.27555466794091343]
2025-05-26      [-0.937921244042259]
2025-05-27      [1.1305306700140256]
2025-05-29     [-1.7640258501459019]
2025-05-24      [1.8675147053352783]
Name: A, dtype: object

#### 양수/음수 확인 함수 만들기

In [68]:
def plusMinus(num):
    return "plus" if num > 0 else "minus"

In [69]:
df["A"].apply(plusMinus)

2025-05-28     plus
2025-05-25    minus
2025-05-26    minus
2025-05-27     plus
2025-05-29    minus
2025-05-24     plus
Name: A, dtype: object

In [70]:
df["A"].apply(lambda num : "plus" if num>0 else "minus")

2025-05-28     plus
2025-05-25    minus
2025-05-26    minus
2025-05-27     plus
2025-05-29    minus
2025-05-24     plus
Name: A, dtype: object